Still happing on this version:
```
Terraform v1.5.7
on darwin_arm64
+ provider registry.terraform.io/oracle/oci v6.4.0
```

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # oci_dns_rrset.wildcard_sub1_domain_com will be updated in-place
  ~ resource "oci_dns_rrset" "wildcard_sub1_domain_com" {
        id              = "zoneNameOrId/ocid1.dns-zone.oc1..aaaaaaaaftfvx2cbvoh7fcfbgeubgtcgyez7gsyqm2odnknwdyynakq4jnaq/domain/%2A.sub1.domain.com./rtype/A"
        # (3 unchanged attributes hidden)

      - items {
          - domain        = "*.sub1.domain.com" -> null
          - is_protected  = false -> null
          - rdata         = "10.1.0.8" -> null
          - record_hash   = "3f324139f47851f1d269078d54de682d" -> null
          - rrset_version = "12" -> null
          - rtype         = "A" -> null
          - ttl           = 300 -> null
        }
      + items {
          + domain        = "*.sub1.domain.com."
          + is_protected  = (known after apply)
          + rdata         = "10.1.0.8"
          + record_hash   = (known after apply)
          + rrset_version = (known after apply)
          + rtype         = "A"
          + ttl           = 300
        }
    }

  # oci_dns_rrset.wildcard_sub2_domain_com will be updated in-place
  ~ resource "oci_dns_rrset" "wildcard_sub2_domain_com" {
        id              = "zoneNameOrId/ocid1.dns-zone.oc1..aaaaaaaaftfvx2cbvoh7fcfbgeubgtcgyez7gsyqm2odnknwdyynakq4jnaq/domain/%2A.sub2.domain.com./rtype/A"
        # (3 unchanged attributes hidden)

      - items {
          - domain        = "*.sub2.domain.com" -> null
          - is_protected  = false -> null
          - rdata         = "138.1.1.63" -> null
          - record_hash   = "bb18395a4568dbdd59ff39981312e872" -> null
          - rrset_version = "13" -> null
          - rtype         = "A" -> null
          - ttl           = 300 -> null
        }
      + items {
          + domain        = "*.sub2.domain.com."
          + is_protected  = (known after apply)
          + rdata         = "138.1.1.63"
          + record_hash   = (known after apply)
          + rrset_version = (known after apply)
          + rtype         = "A"
          + ttl           = 300
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```